<script setup lang="ts">

</script>

<template>
  <div class="container">
    <div class="text">
      <div class="part_1">
        <p class="size_5">
          Многие подростки мечтают об электросамокате, поскольку это современное и удобное средство передвижения. Если
          ребенок уже достиг того возраста, когда ему разрешено водить электрический скутер, то можно смело подыскивать
          ему подходящую модель на лето. Главное, чтобы он осознавал ответственность за вождение и соблюдал правила
          движения.
        </p>
      </div>
      <div class="part_2">
        <h2 class="size_4">Особенности выбора электрического самоката для подростка</h2>
        <p class="size_5">
          Перед покупкой также стоит учесть вес самого подростка. Если пользоваться самокатом будет еще кто-то взрослый,
          то нужно подбирать модель, отталкиваясь от этих значений.
          <br><br>
          Каждый электросамокат обладает рядом дополнительных функций и предметов. Некоторые оснащаются сиденьем для более
          комфортного передвижения, другие же имеют съемный аккумулятор и разъем USB. Родитель должен разграничивать
          детские капризы и действительно нужные опции.
        </p>
      </div>
      <div class="part_3">
        <h2 class="size_4">Какая модель самоката подойдет для эксплуатации в городских условиях?</h2>
        <p class="size_5">
          Качественный электрический самокат не должен быть быстрым. Кроме того, перед покупкой важно проверить скорость
          работы тормозов и качество аккумулятора. Эти элементы не могут быть бракованными, так как от них зависит
          безопасность водителя. В проверенных магазинах продают сертифицированную продукцию. У покупателей меньше шансов
          "нарваться" на поддельный или бракованный товар.
          <br><br>
          Не стоит забывать о технических характеристиках устройства. Если родитель покупает самокат на несколько лет, то
          ему стоит обратить внимание на настраиваемый ограничитель скорости и руль, который также можно отрегулировать.
          По мере взросления ребенка вносятся коррективы в работу самоката.
        </p>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.text {
  margin-bottom: 100px;
  display: flex;
  flex-direction: column;
  gap: 20px;

  & h2 {
    text-transform: uppercase;
    font-style: normal;
    font-weight: 600;
    line-height: 80px;
    color: var(--black-color);
  }

  & p {
    font-style: normal;
    font-weight: 400;
    line-height: normal;
    color: var(--black-color);
  }
}</style>