<script setup lang="ts">

</script>

<template>
  <div class="container">
    <div class="text">
      <div class="part_1">
        <p class="size_5">
          Для того чтобы электросамокат прослужил максимально долго, нужно правильно его заряжать. Современные модели
          оснащены
          удобными и качественными зарядными устройствами, поэтому процесс зарядки не представляет никакой сложности. Мы
          поговорим о том, как продлить жизнь аккумулятора самоката, используя несколько простых правил во время зарядки.
        </p>
      </div>
      <div class="part_2">
        <h2 class="size_4">ОБЩИЕ ПРАВИЛА</h2>
        <p class="size_5">
          Помните, что батарея не должна сильно нагреваться в процессе зарядки – если это происходит, то индикатор будет
          моргать, а также сработает предохранитель от перегрева. Проверьте, исправен ли аккумулятор, нет ли на нем
          вздутия,
          не попадала ли на него влага или грязь. Переставьте зарядку в более прохладное место, дождитесь остывания
          аккумулятора и продолжите процесс (если на батареи не обнаружено повреждений).
        </p>
      </div>
      <div class="part_3">
        <h2 class="size_4">КАК ВЫБРАТЬ ЗАРЯДНОЕ УСТРОЙСТВО?</h2>
        <p class="size_5">
          Все электросамокаты идут в комплекте с зарядными устройствами от производителя – именно они лучше всего подходят
          для
          зарядки. Если же оригинальное зарядное устройство потерялось или сломалось, то нужно заменить его аналогом от
          производителя.
        </p>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.text {
  margin-bottom: 100px;
  display: flex;
  flex-direction: column;
  gap: 20px;

  & h2 {
    text-transform: uppercase;
    font-style: normal;
    font-weight: 600;
    line-height: 80px;
    color: var(--black-color);
  }

  & p {
    font-style: normal;
    font-weight: 400;
    line-height: normal;
    color: var(--black-color);
  }
}
</style>