<script setup lang="ts">

</script>

<template>
  <div class="container">
    <div class="text">
      <div class="part_1">
        <p class="size_5">
          Электрический транспорт за последние годы стал довольно популярным среди людей всех возрастов. Он экологически
          безопасен для окружающей среды, при этом на нем можно с комфортом ездить по городу на большие расстояния. Чаще
          всего его используют для езды на работу или просто для прогулок. Транспортные средства подразделяются на виды.
          Существует электросамокат и электровелосипед, каждый из которых имеет свои преимущества и недостатки.
          Рассмотрим, в чем различия между этими средствами передвижения.
        </p>
      </div>
      <div class="part_2">
        <h2 class="size_4">Электровелосипед</h2>
        <p class="size_5">
          Многие люди привыкли к велосипедам, так как этот тип транспорта пользуется популярностью
          уже много лет. Электрические модели отличаются от обычных тем, что имеют электропривод.
          Он упрощает езду и эксплуатацию велосипеда в целом. Например, ездоку не потребуется прилагать массу усилий,
          чтобы взобраться на горку. Тот, кто не умеет кататься на велосипеде, сможет быстро этому научиться.
        </p>
      </div>
      <div class="part_3">
        <h2 class="size_4">Электросамокат</h2>
        <p class="size_5">
          Электросамокаты можно назвать доступной альтернативой мопедам. С их помощью человек сможет добраться в любую точку города. Для тех, кто проживает в районах с плохими дорогами, выпускаются модели с высокой проходимостью.
        </p>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.text {
  margin-bottom: 100px;
  display: flex;
  flex-direction: column;
  gap: 20px;

  & h2 {
    text-transform: uppercase;
    font-style: normal;
    font-weight: 600;
    line-height: 80px;
    color: var(--black-color);
  }

  & p {
    font-style: normal;
    font-weight: 400;
    line-height: normal;
    color: var(--black-color);
  }
}</style>